### Plan for staging
🟢 Add module.edit_feature_flag_queue_subscription.aws_sns_topic_subscription.topic_queue_subscription["arn:aws:sns:eu-west-1:545209064596:feature_flag_edited"]
🟢 Add module.edit_feature_flag_queue_subscription.aws_sqs_queue_policy.queue_policy
🟢 Add module.edited_feature_flag_queue.datadog_monitor.dead_letter_queue_messages_monitor[0]
🟢 Add module.edited_feature_flag_queue.module.dead_letter_queue[0].aws_sqs_queue.this[0]
🟢 Add module.edited_feature_flag_queue.module.encrypted_queue.aws_sqs_queue.this[0]
🟢 Add module.edited_feature_flag_queue.module.encrypted_queue.aws_sqs_queue_redrive_policy.this[0]
🟡 Modify aws_iam_policy.ab_testing_task_role_policy
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"]
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"]
🟠 Replace module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition

**6 to add, 1 to modify, 3 to replace, 0 to delete**

<details><summary>Show detailed plan</summary>

```terraform
Terraform will perform the following actions:

  # data.aws_iam_policy_document.ab_testing_permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ab_testing_permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:eu-west-1:545209064596:table/ab_test_participants",
              + "arn:aws:dynamodb:eu-west-1:545209064596:table/ab_tests",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "vpc-03e5c953acbcda81b",
                ]
              + variable = "aws:sourceVpc"
            }
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_iam_policy.ab_testing_task_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "ab_testing_task_role_policy" {
        id          = "arn:aws:iam::545209064596:policy/ab-testing-task-role-policy"
        name        = "ab-testing-task-role-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "aws:sourceVpc" = "vpc-03e5c953acbcda81b"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = [
                          - "arn:aws:dynamodb:eu-west-1:545209064596:table/ab_tests",
                          - "arn:aws:dynamodb:eu-west-1:545209064596:table/ab_test_participants",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # module.edit_feature_flag_queue_subscription.data.aws_iam_policy_document.queue_policy_data will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "queue_policy_data" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:GetQueueUrl",
              + "sqs:SendMessage",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:sns:eu-west-1:545209064596:feature_flag_edited",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.edit_feature_flag_queue_subscription.aws_sns_topic_subscription.topic_queue_subscription["arn:aws:sns:eu-west-1:545209064596:feature_flag_edited"] will be created
  + resource "aws_sns_topic_subscription" "topic_queue_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-1:545209064596:feature_flag_edited"
    }

  # module.edit_feature_flag_queue_subscription.aws_sqs_queue_policy.queue_policy will be created
  + resource "aws_sqs_queue_policy" "queue_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.edited_feature_flag_queue.datadog_monitor.dead_letter_queue_messages_monitor[0] will be created
  + resource "datadog_monitor" "dead_letter_queue_messages_monitor" {
      + enable_samples      = (known after apply)
      + evaluation_delay    = (known after apply)
      + id                  = (known after apply)
      + include_tags        = true
      + message             = <<-EOT
            There are currently {{value}} failed messages on edited_feature_flag_dead_letter_queue in staging
                
                Notify:
                    @slack-multi-product-alerts
        EOT
      + name                = "edited_feature_flag_dead_letter_queue staging monitor (Terraform)"
      + new_host_delay      = 300
      + notify_no_data      = false
      + query               = "avg(last_5m):avg:aws.sqs.approximate_number_of_messages_visible{queuename:edited_feature_flag_dead_letter_queue,env:staging} >= 1"
      + renotify_interval   = 360
      + renotify_statuses   = [
          + "alert",
          + "no data",
        ]
      + require_full_window = true
      + tags                = [
          + "env:staging",
          + "team:multi-product",
          + "terraform",
        ]
      + type                = "metric alert"

      + monitor_thresholds {
          + critical = "1"
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "1773635430684422372" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T18:19:21Z" -> (known after apply)
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "5278579264019975996" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T18:19:21Z" -> (known after apply)
        }
    }

  # module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "service_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:545209064596:task-definition/ab-testing:18" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:545209064596:task-definition/ab-testing" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_TRACE_SAMPLE_RATE"
                            value = "0.5"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "0.0.16-79" -> "0.0.17-82"
                        },
                        {
                            name  = "cloud.aws.credentials.instanceProfile"
                            value = "true"
                        },
                        # (5 unchanged elements hidden)
                    ]
                  ~ image            = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.16-79" -> "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.17-82"
                  - mountPoints      = []
                    name             = "ab-testing"
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints  = []
                    name         = "datadog-agent"
                  - volumesFrom  = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - environment           = []
                  - mountPoints           = []
                    name                  = "aws-for-fluent-bit"
                  - portMappings          = []
                  - volumesFrom           = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "envoy"
                  - portMappings     = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ab-testing" -> (known after apply)
      ~ revision                 = 18 -> (known after apply)
      ~ tags                     = {
            "service" = "ab-testing"
          ~ "version" = "0.0.16-79" -> "0.0.17-82"
        }
      ~ tags_all                 = {
          ~ "version"        = "0.0.16-79" -> "0.0.17-82"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.edited_feature_flag_queue.module.dead_letter_queue[0].aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "f21d878e-5e73-4fa0-800d-4a79cf62e399"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "edited_feature_flag_dead_letter_queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "service" = "ab-testing"
        }
      + tags_all                          = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service"        = "ab-testing"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.edited_feature_flag_queue.module.encrypted_queue.aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 180
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 86400
      + kms_master_key_id                 = "f21d878e-5e73-4fa0-800d-4a79cf62e399"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "edited_feature_flag"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "service" = "ab-testing"
        }
      + tags_all                          = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service"        = "ab-testing"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 120
    }

  # module.edited_feature_flag_queue.module.encrypted_queue.aws_sqs_queue_redrive_policy.this[0] will be created
  + resource "aws_sqs_queue_redrive_policy" "this" {
      + id             = (known after apply)
      + queue_url      = (known after apply)
      + redrive_policy = (known after apply)
    }

Plan: 9 to add, 1 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.event_sourcing.module.table.snowflake_table.this,
  on .terraform/modules/event_sourcing.table/snowflake/modules/table/main.tf line 21, in resource "snowflake_table" "this":
  21:   data_retention_days = 7

Use data_retention_time_in_days attribute instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: staging.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "staging.plan"

```
</details>